Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: In today’s computing environments, there are plenty of search tools and in most cases, I would opt to use the search tools provided to me.
ru: В современных средах программирования (текстовых редакторах) есть много инструментов поиска.

source: In view of this, some factors such as the change of the raw material, the life and drop of the total load, external environment and the associated coupling among the sub-systems that influence the control quality of the system in industrial control can be overcomed, the control performance can be improved, the product quality and economic benefit can be increased.
ru: В связи с этим, можно преодолеть влияние факторов таких, как изменение исходного сырья, времени жизни и снижения общей нагрузки, влияние внешней среда и соответствующих связей между подсистемами, которые влияют на качество управления системой в промышленном процессе; в результате, как правило, повышаются и качество управления, качество продукции и экономический эффект.

source: In work (Brunsch T., Raisch J., Hardouin L., Boutin O. (2013) Discrete-Event Systems in a Dioid Framework: Modeling and Analysis.
ru: В работе (Brunsch T., Raisch J., Hardouin L., Boutin O. (2013) Discrete-Event Systems in a Dioid Framework: Modeling and Analysis.

source: In your terminal, type the following command.
ru: В терминале вводится следующую команду.

source: Individual industrial and network-computational system now constitute industrial systems, which have improved overall operation efficiency and reduced consumption of raw materials.
ru: Сейчас конкретные промышленные и сетевые вычислительные системы представляют собой промышленные системы, обеспечивающие высокую общую эффективность эксплуатации и снижение расхода сырья.

source: Information Infrastructure for Supporting Baikal Microbiome Research
ru: Информационная инфраструктура для поддержки исследований микробиома Байкала

source: Information Sciences, 2005, 170(2): 329-349.), authors perform the nominal stability and performance analysis, and verify the distributed predictive control algorithm on the Benchmark process (heavy oil fractionation process).
ru: Information Sciences, 2005, 170(2): 329-349.), авторы находят режим номинальной стабильности и проводят анализа характеристик, затем проверяют полученный распределенный алгоритм предиктивного управления на эталонном процессе (фракционирование тяжелой нефти).

source: Input data, gene data readings, are taken from GS FLX454 sequencer were given as initial data.
ru: Исходные данные, прочтения данных генов, взяты из секвенатора GS FLX454 и были использованы в качестве исходных данных.

source: Instead of just finding a bunch of files, you can perform operations on them.
ru: Вместо того, чтобы просто искать файлs, можно также выполнять с ними другие операции.

source: Instead, I am going to teach you the methodology behind regular expressions that will give you a foundation to work with.
ru: Вместо этого покажем общую методологию использования регулярных выражений, полезную на практике.

source: Introduction
ru: Введение

source: Irkutsk Scientific Center
ru: Иркутский научный центр

source: Irkutsk, Russia
ru: Иркутск, Россия

source: It allows to derive tentative conclusions which means it can withdraw previous conclusions when new information is added.
ru: Это позволяет предварительные результаты вывода уточнять (обновлять) при добавлении новой информации.

source: It based on rewriting, supported by strategies (isser E. (2004) Program Transformation with Stratego/XT.
ru: Технология основана на правилах переписывания (rewriting), поддерживаемые стратегиями (isser E. (2004) Program Transformation with Stratego/XT.

source: It by itself would be an interesting result.
ru: Это само по себе будет интересным результатом.

source: It can also be done by a regular expression utility.
ru: Но это также можно сделать с помощью утилиты, интерпретирующие регулярные выражения.

source: It can derive plausible conclusion from partial or conflicting information.
ru: Он может строить правдоподобный вывод из частичной или противоречивой информации.

source: It comes in two versions–BSD and GNU.
ru: Программа существует в двух версиях: BSD и GNU.

source: It differs from GT by basic representation of the potential activities of the opposing sides and possible ways of application of their capabilities during conflict.
ru: Он отличается от ТИ базовыми представлениями потенциальных действий противоборствующих сторон и возможными способами применения этих возможностей в ходе конфликта.

source: It is a common problem to have conflicting installations of Python on your machine.
ru: Это обычная проблема - порождать версии Python на вашей машине, которые конфликтуют друг с другом.

source: It is a negation symbol.
ru: Это символ отрицания (дополнения).

source: It is able to produce SVG vector images, but the images in general cannot be customized.
ru: Он может создавать векторные изображения SVG, но изображения, как правило, не могут быть настроены.

source: It is also common to struggle to entirely remove Python from your machine.
ru: Кроме того, часто надо полностью удалить все версии Python с компьютера.

source: It is data-driven with facts being asserted into working memory, which results in one or more rules being concurrently true and scheduled for execution by the agenda.
ru: Вывод осуществляется по факту добавления новой информации в рабочую память, что приводит к активации одного или более конкурирующих правил, с соответствующим мехнизмом разрешения конфликтов.

source: It is difficult to know what a reasonable wait time is without benchmarking, but this would be the tool to use for such an analysis.
ru: Трудно определить точное время ожидания без специального тестирования производительности, но для грубой оценки wait вполне подходит.

source: It is great for little find and replace operations across one or more files.
ru: Он отлично подходит для простых операций типа "найти и заменить" над одним или несколькими файлами.

source: It is not important to understand what this means, but understand that it is a structured way that a browser communicates.
ru: Не важно понимать, что это означает, но нужно понимать, что это структурированный способ взаимодействия браузера.

source: It is often difficult to explain these concepts with complex websites like www.google.com because their infrastructure is so complex.
ru: Эти концепции сложно объяснить с помощью сложных веб-сайтов, таких как www.google.com потому что их инфраструктура очень сложна.

source: It is recommended that you place it in the ~/.profile file as described in this tutorial.
ru: Рекомендуется поместить ее в ~/.profile-файл, как описано в в этом руководстве.

source: It is sufficient to define implicitly logics of action of all agents, entering MAS, and to construct the initial state of this MAS, i.e. set of initial states of its agents.
ru: Достаточно определить внутреннюю логику действий всех участников, образующих МАС, и задать начальное состояние всей системе, т.е. набор начальных состояний составляющих агентов.

source: It is the operations of so-called High-Throughput Screening Systems, an important technology to rapidly test thousands of biochemical substances.
ru: При помощи таких моделей исследуется поведение так называемых высокопроизводительных систем скрининга, важных технологий высокопроизводительного тестирования тысяч биохимических веществ.

source: It is very hard to construct a complete set of rules for recognition and transition synthesis for the domain, which is under investigation.
ru: Построение полного набора правил для распознавания и синтеза управления (реагирования на события) для конкретной исследуемой предметной области - очень сложная задача.

source: It may be compared to the safety property of the controlled system: no uncontrolled event which is not allowed by specification may occur.
ru: Его можно сравнить со свойством надежности управляемой системы: запрещается возникновение неконтролируемых событий, не допускающихся спецификацией.

source: It sucks up considerable processing time to have to align, calculate distances, and cluster each of these sequences individually.
ru: Это требует значительного времени обработки при выполнении выравнивания, расчета расстояний, и кластеризации каждой из этих последовательностей в отдельности.

source: It would be difficult to manage a new IP address for each device out in the wild, but with our local area network, it is simple.
ru: Было бы сложно управлять новым IP-адресом для каждого устройства в "дикой природе", но с нашей локальной сетью это просто.

source: It would be inconvenient to break out of a bash script, run a python script, and then start your script again, so sed and awk provide nice alternatives to this workflow.
ru: Было бы неудобно вручную останавливать сценарий bash, запускать скрипт python, а затем перезапускать сценарий снова. Утилиты sed и awk предоставляют возможность избегать такого варианта обработки информации.

source: It's primary usage is as a preliminary step to running shhh.seqs.
ru: Команда организует предварительный этап обработки [чего?], за которым следует запуск ```shhh.seqs```.

source: Items of the multisets are similar to term and atom in sense of data representation.
ru: Элементы мультимножеств аналогичны термам и атомам систем АДТ, если их рассматривать в контексте представления данных программ.

source: Its primary purpose is to teach biologists to analyze single genomes, it can be extended to implement other NGS research.
ru: Его основная цель - научить биологов анализировать отдельные геномы, его можно расширить для проведения других исследований NGS.

source: Just like grep, awk, and sed, scrolling and searching through output can be done in advanced text editors like VSCode fairly easily and if you have the opportunity to use these more advanced tools, go ahead and do so.
ru: Так же, как grep, awk и sed, прокрутка и поиск в тексте удобнее делть в текстовых редакторах, например, VSCode. Если есть возможность используйте редактор.

source: Just like we have the ^ at the beginning of each expression, we can place the $ at the end of the expressions to indicate we have reached the end of our line.
ru: Так же, как символ ^ обозначает начало строки, использование $ в конце выражений указывает конец этой же строки.

source: Just type the letter k followed by the process ID.
ru: Делается это нажатием клавиши k и указанием номера процесса.

source: Knowing that these new workbooks would always contain the word “Book” at the beginning, I was able to use a regular expression to identify them.
ru: Зная, что новые книги всегда будут содержать слово «Book» в начале, можно использовать регулярное выражение для их идентификации.

source: Knowing this, we can conclude that the “boundary” for a regular expression is just a single line.
ru: Можно сделать вывод, что «граница» применимости регулярного выражения - это одна строка текста.

source: Later in the command, you will see file and directory names.
ru: Далее можно будет посмотреть, как разделять файлы и каталоги.

source: Latest version of our automatic theorem proving (ATP) software (provers) have RAM (Random Allocated Memory) allocation engines efficiently implementing indexing over the sets of terms.
ru: Последняя версия программного обеспечения автоматического доказательства теорем (АДТ) реализует эффективные по использованию оперативной памяти механизмы построения индексов над множествами термов.

source: Learning awk entirely would take far more time than is warranted here in this tutorial, but if you can remember the basic syntax, you’ll be good to go.
ru: Обучение всем возможностям awk займает гораздо больше времени, чем это оправдано для данного руководства, но освоив основу синтаксиса, проще изучить все остальное.

source: Learning how to match all four of the emails with a single regular expression will demonstrate a lot of the concepts that we have covered.
ru: Изучение вариантов использования регулярных выражений для распознавания всех четырех адресов продемонстрирует множество рассмотренных концепций.

source: Less
ru: Программа Less

source: Less is one of those command line utilities that you are probably not using and should be.
ru: Программа less одной из тех утилит командной строки, которую вы наверняка не используете, а должны были бы.

source: Less is simple to use, and works very similar to vim.
ru: Программа проста в использовании, и работает аналогично редактору vim.

source: Let me first start by addressing the fact that there are many different versions of regular expressions.
ru: Прежде всего надо сказать, что существует множество различных версий регулярных выражений.

source: Let me give you an extremely practical example from my own work to explain.
ru: Приведем ряд часто встречающихся практических примеров.

source: Let us start with the following text.
ru: Начнем со следующего текста.

source: Let’s create a directory in our home folder that will hold all our custom scripts.
ru: Теперь создадим каталог в домашней папке, который будет хранить все наши скрипты.

source: Let’s now stop it again, start it again, and then bring it back to the foreground.
ru: Снова остановим его и вернем на передний план.

source: Let’s say I wanted to download a Google image to my VPS for whatever reason.
ru: Допустим, по какой-то причине надо загрузить картинку Google на VPS.

source: Let’s say I wanted to get the date and time of each request in this file.
ru: Допустим, надо получить дату и время каждого запроса в каждом ответе.

source: Let’s say that I had the following file of text called http-request.txt.
ru: Допустим, есть следующий текстовый файл с именем http-request.txt.

source: Let’s say we had the following file called email-addresses.txt:
ru: Пусть задан следующий файл с именем email-addresses.txt :

source: Let’s take a look at an example of each and cover the basic usage of both tools.
ru: Рассмотрим примеры каждой из задач, покажем использование обоих инструментов.

source: Let’s try it.
ru: Попробуем.

source: Likewise, we changed the second regular expression from .+ to \w+, which does the same thing.
ru: Аналогично во втором выражении .+ заменено на \w+, что распознает эти же подстроки.

source: Lions (2006), and, in the same time, of P. Caines, Minyi Huang and Roland Malhamé (2007).
ru: Lions (2006), и, примерно в это же время, P. Caines, Minyi Huang и Roland Malhamé (2007).

source: Luckily, Excel opens new workbooks and names them “Book1”, “Book2”, “Book3”, “Book4”, etc.
ru: К счастью, Excel открывает новые книги и называет их “Book1”, “Book2”, “Book3”, “Book4” и т.д.

source: Mac computers will come with the BSD version while linux computers will come with the GNU version.
ru: В системах Mac используются BSD-вариянт, системы с Linux - GNU.

source: Main R&D activity in the NGS domain are divided on three main directions: development new efficient algorithms for data processing operations and building charts, organizing standardized cloud computing pipelines with HPC implementations of various operations, and representing pipelines as workflows, as well as user interfaces to support interactive data processing and assessment.
ru: Основная деятельность НИОКР в области NGS разделена на три основных направления: разработка новых эффективных алгоритмов для операций обработки данных и построения диаграмм, организация стандартизированных конвейеров облачных вычислений с реализациями различных операций HPC (High performance comuting) и представление конвейеров в виде рабочих процессов, а также пользовательских интерфейсов для поддержки интерактивной обработки и оценки данных.

source: Main criticism of the tools is presented in [21], where it is stated, that command line utilities support more functions and have higher flexibility than visual tools.
ru: Основная критика инструментов представлена в [21], где утверждается, что утилиты командной строки поддерживают больше функций и обладают большей гибкостью, чем визуальные инструменты.

source: Main reason using clouds here is the accumulation of the RAM if data would not fit in the workstation memory.
ru: Основной причиной использования облаков здесь является накопление оперативной памяти, если данные не помещаются в памяти рабочей станции.

source: Making a mistake or returning to a previous step to refine a coefficient, researcher must trace the filenames manually.
ru: Совершив ошибку или вернувшись к предыдущему шагу для уточнения коэффициента, исследователь должен вручную вводить исходные имена файлов.

source: Many ISPs own a variety of hardware that all are capable of carrying the analog signals we know as the “internet”.
ru: Многие интернет-провайдеры имеют оборудование для передачи аналоговых сигналов, известных как «Интернет».

source: Many times this command could be used to find the path where a specific executable is stored on the filesystem so you can edit, move, or remove it.
ru: Команда find возвращвет полный путь до файла по имени и или атрибутам: запускаемый, читаемый, редактируемый и т.д.

source: Many times when we download a software release or series of large files or images, we will get them in the .tar, .gz, or even .tar.gz formats.
ru: Часто, при загрузке релиза программы или серии больших файлов или изображений, мы можем получить их в формате .tar, .gz, или даже .tar.gz.

source: Many will argue the superior performance of sed and awk in certain situations, but for all practical purposes, it is more often the case that Perl or Python will be the better solution.
ru: В защиту утилит высказывают, что sed и awk обладают превосходной производительностью на определенных задачах, но практика показывает, что Perl или Python все же лучшие решения.

source: Mathematical representation of the resource-driven games is based on usage of multisets, where each item of a multiset is an amount of a resource representation (<resource-kind, amount>).
ru: Математическое представление ресурсно-управляемых игр использует мультимножества, где каждый элемент мультимножества - это двойка вида <вид ресурса, количество>.

source: Matrosov Institute for System Dynamics
ru: Институт динамики систем и теории управления

source: Maybe I wanted to match any user that had a name equaling 3 characters.
ru: Например, чтобы найти всех пользователей, имена которых состоят из трех символов,

source: Maybe you are managing a remote machine and you simply cannot access this awesome search feature?
ru: Такое может быть, если вы управляете удаленной машины, или, просто, к этой удивительной функции поиска нет доступа?

source: Maybe you installed a version of Python a long time ago and cannot remember where you downloaded it.
ru: Например, давным-давно вы установили нужную вам версию Python и не можете вспомнить, куда вы скачали архив его исходников.

source: Maybe you want to only match numbers 1-5.
ru: Например, нужны только цифры от 1 до 5.

source: Memory
ru: Оперативная память (RAM)

source: Metadata of the database stored objects describes mostly relations between a resource and its attributes.
ru: Метаданные хранимых объектов базы данных в основном описывают отношения между ресурсом и его атрибутами.

source: Method of positively constructed formulas (PCFs) is being developed and adopted to various domains.
ru: Метод позитивно-образованных формул (ПОФ) разрабатывается и принимается в различных предметных областях.

source: MiSeq first stages representation as dataflow modules [22]
ru: Представление первых этапов MiSeq в виде модулей потока данных [22]

source: MiSeq standard operational procedure
ru: Стандартная операционная процедура MiSeq

source: Microbial community analysis
ru: Анализ микробного сообщества

source: Modeling the competitive environment is relatively new in the field of research.
ru: Моделирование конкурентной среды является относительно новым в этой области исследований.

source: Modem
ru: Модем

source: Modular supervisors for DSS have been constructed for control of on a top level and AUV (autonomous underwater vehicles) group with automatic theorem proving on the bases of PCFs.
ru: Построены модульные супервизоры для ДСС, осуществляющие управление на верхнем уровне и на уровне групп автономных необитаемых аппаратов при помощи автоматического доказательства теорем на основе ПОФ.

source: Most attention was paid to the local processes (within a company).
ru: Наибольшее внимание уделялось внутренним процессам (в рамках одной компании).

source: Most of the commands we have learned (with the exception of the awk) command are for strict usage on the command line, but what if you wanted to put some of these in a script to run?
ru: Большинство изученных команд (за исключением awk) предназначены только для использования в командной строке, но что, если попробовать поместить некоторые из них в сценарий (программу на языке bash)?

source: Most of the results of decentralized control are associated with this approach (W.M. Wonham, F. Lin, K. Rudie, G. Barrett, R. Cieslak, S. Takai et al.).
ru: Большинство результатов в области децентрализованного управления связаны с этим подходом (W.M. Wonham, F. Lin, K. Rudie, G. Barrett, R. Cieslak, S. Takai et al.).

source: Most of the time, we an rely on our computer’s file explorer to be able to handle these formats, but sometimes, we need to unzip or decompress them on the command line (think remote server).
ru: В большинстве случаев можно использовать файловый менеджер компьютера, он способен обрабатывать эти форматы, но иногда нужно распаковать файл в командной строке (например, на удаленном сервере).

source: Most of what this tool prints is out of the scope of what we discussed above, but I’ll mention it nevertheless because it is a crucial tool for understanding how your computer is communicating with the outside world.
ru: Большая часть того, что эта программа выводит, выходит за рамки обсуждаемого выше, она заслуживает упоминания, так как это важный инструмент для понимания того, как компьютер общается с внешним миром.

source: Most used of them are Cython and SWIG (www.swig.org).
ru: Наиболее часто используемые из них - это Cython и SWIG (www.swig.org).

source: Most works are not cover the organization behavior in a perspective more than a couple of possible steps.
ru: Большинство подобных работ не анализирует поведение организации в перспективе более чем на пару шагов.

source: Mothur simple filtering commands are easily run in parallel, indeed it uses CPU cores, but the computational complexity seems to be not as high as it would be reasonable to spend time on splitting and joining.
ru: Простые команды фильтрации Mothur легко запускаются параллельно, используя отдельные ядра ЦП, но вычислительная сложность кажется не такой высокой, чтобы было бы рационально тратить время на их разделение и объединение.

source: Moving down to the actual output of the top command, you may notice that it updates every few seconds.
ru: Наблюдая за текстом, выдаваемом командой top, можно заметить, что он обновляется каждые несколько секунд.

source: Moving forward, I will be writing two regular expressions with different syntax that both do the same things.
ru: Сделаем этот также разными способами, которые делают одно и то же.

source: My new key is stored as /home/zach/.ssh/id_digitalocean_rsa.
ru: Новый ключ автора в /home/zach/.ssh/id_digitalocean_rsa.

source: My regular expression was quite simple, and looked like this: ^Book[0-9]+.
ru: Полученное регулярное выражение довольно просто и выглядит так: ^Book[0-9]+.

source: My router uses the domain name server sitting at 208.67.222.123.
ru: Данный маршрутизатор использует сервер доменных имен, расположенный по адресу 208.67.222.123.
